herrceedjay/HU-058_ESPHome-ESP8266/firmware/esphome/components/aip33628/aip33628.cpp
#include "aip33628.h"
#include "esphome/core/helpers.h"
#include "esphome/core/log.h"

#include <cmath>
#include <Arduino.h>
#include <esp8266_peri.h>

namespace esphome {
namespace aip33628 {

static const char *const TAG = "aip33628";
static Aip33628Panel *scan_instance = nullptr;

// Each digit is one driver plus one pair of COM pairs, ten LED positions.
// Driver 1 carries the hours, driver 2 the minutes.
struct Block {
  uint8_t drv;
  uint8_t com_lo;
  uint8_t com_hi;
};
static const Block BLOCKS[4] = {
    {0, 0x30, 0xC0},  // hour tens,   annunciator AM
    {0, 0x03, 0x0C},  // hour ones,   annunciator colon
    {1, 0x30, 0xC0},  // minute tens, annunciator date dash
    {1, 0x03, 0x0C},  // minute ones, annunciator degree mark
};

// Segment position within a block. Side 0 is COM low, side 1 is COM high.
struct SegPos {
  uint8_t side;
  uint8_t led;
};
static const SegPos SEGMAP[9] = {
    {1, 5},  // A top
    {1, 4},  // B top right
    {1, 3},  // C bottom right
    {1, 2},  // D bottom
    {0, 5},  // E bottom left
    {0, 4},  // F top left
    {0, 3},  // G middle
    {1, 1},  // annunciator
    {0, 1},  // second annunciator, block 1 colon only
};
enum { SEG_ANNUN = 7, SEG_ANNUN2 = 8 };

// Physical position of every LED, extracted in docs/led-layout.md. The ids
// are the ones on the board layout map. Order matches SEGMAP.
const PosGeom GEOM[4][9] = {
    {  // block 0, hour tens
        { 1,  19,   8},  // A top
        { 7,  41,  66},  // B top right
        { 6,  40, 194},  // C bottom right
        { 5,  19, 255},  // D bottom
        { 4,   0, 188},  // E bottom left
        { 2,   0,  66},  // F top left
        { 3,  20, 130},  // G middle
        { 8,  20,  65},  // AM mark
        {0, 0, 0},  // unwired
    },
    {  // block 1, hour ones
        { 9,  93,   0},  // A top
        {15, 112,  61},  // B top right
        {14, 111, 198},  // C bottom right
        {13,  90, 246},  // D bottom
        {12,  72, 184},  // E bottom left
        {10,  73,  65},  // F top left
        {11,  92, 124},  // G middle
        {16, 128,  68},  // colon upper
        {18, 129, 189},  // colon lower
    },
    {  // block 2, minute tens
        {19, 163,   5},  // A top
        {25, 185,  67},  // B top right
        {24, 185, 195},  // C bottom right
        {23, 165, 247},  // D bottom
        {22, 145, 188},  // E bottom left
        {20, 143,  70},  // F top left
        {21, 164, 122},  // G middle
        {17, 128, 128},  // date dash
        {0, 0, 0},  // unwired
    },
    {  // block 3, minute ones
        {27, 233,  11},  // A top
        {33, 255,  60},  // B top right
        {32, 255, 190},  // C bottom right
        {31, 234, 249},  // D bottom
        {30, 216, 194},  // E bottom left
        {28, 216,  68},  // F top left
        {29, 235, 128},  // G middle
        {26, 204,  18},  // degree mark
        {0, 0, 0},  // unwired
    },
};

// Seven segment font, bit 0 = A through bit 6 = G. The letters are the subset
// that reads unambiguously on seven segments, so a caller can put a unit or a
// short label in the rightmost position.
static uint8_t glyph(char c) {
  switch (c) {
    case 'A': return 0b1110111;
    case 'b': return 0b1111100;
    case 'C': return 0b0111001;
    case 'c': return 0b1011000;
    case 'd': return 0b1011110;
    case 'E': return 0b1111001;
    case 'F': return 0b1110001;
    case 'H': return 0b1110110;
    case 'h': return 0b1110100;
    case 'L': return 0b0111000;
    case 'n': return 0b1010100;
    case 'o': return 0b1011100;
    case 'P': return 0b1110011;
    case 'r': return 0b1010000;
    case 't': return 0b1111000;
    case 'U': return 0b0111110;
    case 'u': return 0b0011100;
    case 'y': return 0b1101110;
    case '0': return 0b0111111;
    case '1': return 0b0000110;
    case '2': return 0b1011011;
    case '3': return 0b1001111;
    case '4': return 0b1100110;
    case '5': return 0b1101101;
    case '6': return 0b1111101;
    case '7': return 0b0000111;
    case '8': return 0b1111111;
    case '9': return 0b1101111;
    case '-': return 0b1000000;
    default:  return 0;
  }
}

// Home Assistant sends gamma encoded values and the panel is linear in
// current and in duty, so both have to be linearized here. 2.8 is the same
// exponent ESPHome uses by default, which is why gamma_correct is set to 1.0
// on the light itself. Applying it in both places would square it.
static const float PANEL_GAMMA = 2.8f;

// Slider position to a current step. A plain gamma curve assumes the output
// can reach zero. This panel bottoms out at IS_MA[0], so a third of the
// slider ends up clamped against that floor with nothing to show for it.
// Interpolating perceived output between the floor and full instead puts all
// sixteen steps across the whole slider.
static uint8_t current_for(float brightness) {
  const float p_min = powf((float) IS_MA[0] / (float) IS_MA[15], 1.0f / PANEL_GAMMA);
  float p = p_min + clamp(brightness, 0.0f, 1.0f) * (1.0f - p_min);
  float want = powf(p, PANEL_GAMMA) * (float) IS_MA[15];
  uint8_t best = 0;
  for (uint8_t i = 1; i < 16; i++) {
    if (fabsf((float) IS_MA[i] - want) < fabsf((float) IS_MA[best] - want))
      best = i;
  }
  return best;
}

// Half brightness keeps the all-white hardware check brief and predictable.
static const float LAMP_BRIGHTNESS = 0.5f;

// Color component to a duty level. Duty is linear light, so the component
// has to be linearized before it is rounded, or every pastel rounds up to a
// saturated color. Pink is the clearest case, and rounds all the way to
// white.
static uint8_t duty_level(float c) {
  return (uint8_t) lroundf(powf(clamp(c, 0.0f, 1.0f), PANEL_GAMMA) * (COLOR_LEVELS - 1));
}

static int com_index(uint8_t cs) {
  for (int i = 0; i < 4; i++) {
    if (COM_SEQ[i] == cs) return i;
  }
  return 0;
}

void Aip33628Panel::setup() {
  for (auto *p : {clk_, data_, clk2_, data2_}) {
    p->setup();
    p->digital_write(false);
  }
  clk_mask_ = 1u << clk_->get_pin();
  data_mask_ = 1u << data_->get_pin();
  clk2_mask_ = 1u << clk2_->get_pin();
  data2_mask_ = 1u << data2_->get_pin();

  render_();

  // ESP8266 Timer1 runs from the 80MHz peripheral clock. With TIM_DIV16 it
  // ticks at 5MHz, so one UNIT_US=40us scan tick is 200 timer ticks.
  
  scan_instance = this;
  timer1_disable();
  timer1_detachInterrupt();
  timer1_isr_init();
  timer1_attachInterrupt(&Aip33628Panel::scan_tick_);
  timer1_enable(TIM_DIV16, TIM_EDGE, TIM_LOOP);
  timer1_write(UNIT_US * 5);
}

void Aip33628Panel::dump_config() {
  ESP_LOGCONFIG(TAG, "AiP33628 panel:");
  LOG_PIN("  CLK: ", clk_);
  LOG_PIN("  DATA: ", data_);
  LOG_PIN("  CLK_1: ", clk2_);
  LOG_PIN("  DATA_1: ", data2_);
  ESP_LOGCONFIG(TAG, "  Max current: IS 0x%X, %u.%umA per lit sink", max_current_,
                IS_MA[max_current_] / 10, IS_MA[max_current_] % 10);
  ESP_LOGCONFIG(TAG, "  Hour format: %s", twelve_hour_ ? "12 hour" : "24 hour");
  ESP_LOGCONFIG(TAG, "  Colon: %s", blink_colon_ ? "blinking" : "steady");
  ESP_LOGCONFIG(TAG, "  Network: %s", online_ ? "up" : "down");
  const char *fx = effect_ == Effect::CYCLE ? "color cycle"
                   : effect_ == Effect::FLASH ? "flash" : "none";
  const char *sp = spread_ == Spread::DIGIT ? "per digit"
                   : spread_ == Spread::LED ? "per LED" : "whole panel";
  // INFO rather than LOGCONFIG on purpose. The rest of this block is wiring
  // that cannot change, but the effect is live state worth being able to read
  // back, and CONFIG level messages need a DEBUG logger to be visible at all.
  ESP_LOGI(TAG, "  Effect: %s, %s, %.1fs, axis %.0f deg, hue span %.0f deg, flash fade %.2fs",
           fx, sp, effect_speed_, effect_angle_, hue_span_, flash_fade_);
}

// Emit one 30-bit frame to each driver and latch both. Bits are LSB first:
// SS[15:0], CS[7:0], IS[3:0], then two reserved zeros. Data only changes
// while CLK is low. The latch is a DATA rising edge while CLK is held high
// after the last bit, which is the sequence the stock 8051 produces.
//
// CS and IS are common to the two drivers and only SS differs, so one pass
// down the bits clocks both buses. That halves the work outright, and going
// straight to the GPOS/GPOC registers.
// The AiP33628 accepts 30MHz and asks for only 16ns of
// CLK high and low, so explicit delay padding is not required.
void IRAM_ATTR Aip33628Panel::send_pair_(uint16_t ss1, uint16_t ss2, uint8_t cs, uint8_t is) {
  const uint32_t wire = (uint32_t) IS_WIRE[is & 0xF] << 24;
  uint32_t f1 = (uint32_t) ss1 | ((uint32_t) cs << 16) | wire;
  uint32_t f2 = (uint32_t) ss2 | ((uint32_t) cs << 16) | wire;
  const uint32_t clks = clk_mask_ | clk2_mask_;
  const uint32_t dats = data_mask_ | data2_mask_;

