herrceedjay/HU-058_ESPHome-ESP8266/firmware/esphome/components/aip33628/aip33628.cpp
  GPOC = clks | dats;

  for (int i = 0; i < 30; i++) {
    uint32_t set = 0;
    if (f1 & 1)
      set |= data_mask_;
    if (f2 & 1)
      set |= data2_mask_;
    f1 >>= 1;
    f2 >>= 1;
    // Data settles while CLK is low, then one rising edge shifts both buses.
    GPOC = dats & ~set;
    GPOS = set;
    GPOS = clks;
    if (i < 29)
      GPOC = clks;
  }

  // CLK is still high after bit 29. A DATA rising edge here is the latch.
  GPOC = dats;
  GPOS = dats;
  GPOC = dats;
  GPOC = clks;
}

// Walk the schedule the renderer built. The timer runs at a fixed UNIT_US
// and this counts ticks, rather than reprogramming the alarm per step.
// Reprogramming would be fewer interrupts, but an alarm set shorter than the
// counter has already reached never matches, and a single late interrupt
// would then freeze the panel until reboot. A fixed auto-reload alarm cannot
// do that: a late interrupt costs one wobbly sub-frame and nothing more.
//
// Most ticks do nothing. A saturated color collapses to one step per COM
// pair, so fourteen of every fifteen calls are a decrement and a return.
void IRAM_ATTR Aip33628Panel::scan_tick_() {
  auto *self = scan_instance;
  if (self == nullptr)
    return;

  if (self->wait_ > 0) {
    self->wait_--;
    return;  //Void function
  }

  const ScanBuf &b = self->buf_[self->front_];

  // The renderer can flip the buffer between two steps, and the new schedule
  // may be shorter than the old one, so the index is clamped rather than
  // trusted. Worst case is one odd frame while a slider is moving.
  uint8_t i = self->step_;
  if (i >= b.n)
    i = 0;
  const ScanStep &st = b.step[i];

  self->send_pair_(st.ss[0], st.ss[1], st.cs, b.is);

  self->wait_ = (uint8_t) (st.units - 1);  // this tick is the first of the step
  uint8_t next = (uint8_t) (i + 1);
  self->step_ = next >= b.n ? 0 : next;
}

void Aip33628Panel::write_pos_(uint8_t block, uint8_t seg, bool on) {
  on_[block][seg] = on;
}

void Aip33628Panel::write_digit_(uint8_t block, char c) {
  uint8_t bits = glyph(c);
  for (int s = 0; s < 7; s++) {
    on_[block][s] = (bits >> s) & 1;
  }
}

// brightness is linear and carries the transition state, so it falls to zero
// on its own during a fade to off. The color components are the normalized
// ratio and do not scale with it. ESPHome guarantees the largest of the three
// is 1, so at least one channel always survives duty_level and a color can
// never round away to nothing.
void Aip33628Panel::set_light(bool on, float r, float g, float b, float brightness) {
  enabled_ = on && brightness > 0.0f;

  // Picking a new color on the master light means the whole panel, so it
  // drops the digit and position tiers. Moving only the brightness slider
  // leaves them alone, which matters because a transition calls this on
  // every step and would otherwise wipe a gradient mid fade.
  bool color_moved = fabsf(r - base_rgb_[0]) > 0.002f || fabsf(g - base_rgb_[1]) > 0.002f ||
                     fabsf(b - base_rgb_[2]) > 0.002f;
  if (color_moved && effect_ == Effect::NONE) {
    for (bool &v : digit_set_)
      v = false;
    clear_positions_();
  }

  base_rgb_[0] = r;
  base_rgb_[1] = g;
  base_rgb_[2] = b;
  requested_current_ = current_for(brightness);
  apply_colors_();
}

// Quantize whatever color each block is currently supposed to be. Everything
// that changes a color goes through here, so there is one place that decides
// what a block ends up at and one place that marks the panel dirty.
void Aip33628Panel::apply_colors_() {
  // The lamp test outranks every color tier, including a running effect.
  if (mode_ == Mode::LAMP) {
    for (auto &blk : level_)
      for (auto &seg : blk)
        for (uint8_t &ch : seg)
          ch = COLOR_LEVELS - 1;
    dirty_ = true;
    return;
  }

  for (int blk = 0; blk < 4; blk++) {
    for (int seg = 0; seg < 9; seg++) {
      const float *c = pos_set_[blk][seg]  ? pos_rgb_[blk][seg]
                       : digit_set_[blk]   ? digit_rgb_[blk]
                                           : base_rgb_;
      level_[blk][seg][CH_RED] = duty_level(c[0] * envelope_);
      level_[blk][seg][CH_GREEN] = duty_level(c[1] * envelope_);
      level_[blk][seg][CH_BLUE] = duty_level(c[2] * envelope_);
    }
  }
  dirty_ = true;
}

// A digit of -1 sets all four at once, which is what a whole display effect
// wants. Components are taken as given and not normalized: the master light
// arrives already normalized with its magnitude in the current setting, but a
// caller here is asking for one digit to look a particular way next to the
// others, and scaling that back up would throw away the difference.
void Aip33628Panel::set_digit_color(int digit, float r, float g, float b) {
  if (digit < -1 || digit > 3)
    return;
  for (int blk = 0; blk < 4; blk++) {
    if (digit != -1 && digit != blk)
      continue;
    digit_rgb_[blk][0] = clamp(r, 0.0f, 1.0f);
    digit_rgb_[blk][1] = clamp(g, 0.0f, 1.0f);
    digit_rgb_[blk][2] = clamp(b, 0.0f, 1.0f);
    digit_set_[blk] = true;
    // Setting a whole digit drops any per position color inside it. Without
    // this a gradient would sit on top and the digit color would do nothing
    // visible, which reads as the call being ignored.
    for (bool &v : pos_set_[blk])
      v = false;
  }
  apply_colors_();
}

// Hand the whole panel back to the master light, per position overrides
// included. Anything else would leave a gradient stuck on with no obvious way
// to clear it.
void Aip33628Panel::clear_digit_colors() {
  for (bool &v : digit_set_)
    v = false;
  clear_positions_();
  apply_colors_();
}

void Aip33628Panel::clear_positions_() {
  for (auto &blk : pos_set_)
    for (bool &v : blk)
      v = false;
}

// One LED, addressed by the id on the board layout map rather than by block
// and segment, so the numbering here is the same one written on the map.
void Aip33628Panel::set_position_color(int id, float r, float g, float b) {
  for (int blk = 0; blk < 4; blk++) {
    for (int seg = 0; seg < 9; seg++) {
      if (GEOM[blk][seg].id != id)
        continue;
      pos_rgb_[blk][seg][0] = clamp(r, 0.0f, 1.0f);
      pos_rgb_[blk][seg][1] = clamp(g, 0.0f, 1.0f);
      pos_rgb_[blk][seg][2] = clamp(b, 0.0f, 1.0f);
      pos_set_[blk][seg] = true;
      apply_colors_();
      return;
    }
  }
}

// A linear ramp across the panel between two colors. Angle is in degrees, 0
// running left to right and 90 top to bottom, so -45 runs from the bottom
// left corner to the top right.
//
// The ramp is normalized against the LEDs themselves rather than the panel
// outline, so the two colors asked for land exactly on the outermost LEDs
// whichever way the ramp points. Normalizing against the corners instead
// leaves both ends short, because no LED sits in a corner.
void Aip33628Panel::set_gradient(float r0, float g0, float b0, float r1, float g1, float b1,
                                 float angle_deg) {
  const float a = angle_deg * 3.14159265f / 180.0f;
  const float ca = cosf(a), sa = sinf(a);

  float lo = 1e9f, hi = -1e9f;
  for (int blk = 0; blk < 4; blk++) {
    for (int seg = 0; seg < 9; seg++) {
      const PosGeom &g = GEOM[blk][seg];
      if (g.id == 0)
        continue;
      float t = (g.nx / 255.0f) * ca + (g.ny / 255.0f) * sa;
      if (t < lo)
        lo = t;
      if (t > hi)
        hi = t;
    }
  }
  float span = hi - lo;
  if (span < 1e-6f)
    span = 1.0f;

