herrceedjay/HU-058_ESPHome-ESP8266/firmware/esphome/components/aip33628/aip33628.cpp
  for (int blk = 0; blk < 4; blk++) {
    for (int seg = 0; seg < 9; seg++) {
      const PosGeom &g = GEOM[blk][seg];
      if (g.id == 0)
        continue;  // nothing wired here
      float t = ((g.nx / 255.0f) * ca + (g.ny / 255.0f) * sa - lo) / span;
      t = clamp(t, 0.0f, 1.0f);
      pos_rgb_[blk][seg][0] = clamp(r0 + (r1 - r0) * t, 0.0f, 1.0f);
      pos_rgb_[blk][seg][1] = clamp(g0 + (g1 - g0) * t, 0.0f, 1.0f);
      pos_rgb_[blk][seg][2] = clamp(b0 + (b1 - b0) * t, 0.0f, 1.0f);
      pos_set_[blk][seg] = true;
    }
  }
  apply_colors_();
}

// A temporary mode is capped rather than trusted. Ten minutes is far longer
// than any of these are useful for, and it means a bad automation cannot park
// the panel on a stale number forever.
static uint32_t mode_lifetime(int ms) {
  if (ms < 100) return 100;
  if (ms > 600000) return 600000;
  return (uint32_t) ms;
}

void Aip33628Panel::show_seconds(int ms) {
  mode_ = Mode::SECONDS;
  mode_until_ = millis() + mode_lifetime(ms);
  dirty_ = true;
}

void Aip33628Panel::show_number(int value, const std::string &unit, int ms) {
  number_ = value;
  // First character only. An empty unit gives the number the whole panel.
  unit_ = unit.empty() ? '\0' : unit[0];
  mode_ = Mode::NUMBER;
  mode_until_ = millis() + mode_lifetime(ms);
  dirty_ = true;
}

// Every populated position, white, at a fixed brightness, for a few seconds.
// This is a hardware check, so user color and brightness settings do not
// change the result.
void Aip33628Panel::lamp_test(int ms) {
  mode_ = Mode::LAMP;
  mode_until_ = millis() + mode_lifetime(ms);
  lamp_current_ = current_for(LAMP_BRIGHTNESS);
  apply_colors_();
}

// Right aligned, no colon. A unit takes the rightmost position and leaves
// three for the number, so 78F and -5C both fit. Without one the number gets
// all four. Out of range values are clamped rather than wrapped, because a
// wrapped temperature is a wrong reading and a clamped one is obviously
// pinned against the end.
//
// The widest values reach the hour tens position. With a unit that only
// happens at three digits or a signed two, and never for a temperature in F.
void Aip33628Panel::draw_number_(int value, char unit) {
  int pos = 3;
  if (unit != '\0' && glyph(unit) != 0) {
    write_digit_(3, unit);
    pos = 2;
    // C and F are temperatures, so light the degree mark ahead of the unit.
    if (unit == 'C' || unit == 'c' || unit == 'F')
      write_pos_(3, SEG_ANNUN, true);
  }

  bool neg = value < 0;
  if (neg) value = -value;

  int room = pos + 1 - (neg ? 1 : 0);  // positions left for digits
  int limit = 1;
  for (int i = 0; i < room; i++) limit *= 10;
  if (value > limit - 1) value = limit - 1;

  do {
    write_digit_(pos--, (char) ('0' + value % 10));
    value /= 10;
  } while (value > 0 && pos >= 0);
  if (neg && pos >= 0) write_digit_(pos, '-');
}

// Full saturation hue to RGB. Effects ride the color wheel rather than the
// master light's color, because a rainbow that keeps the user's tint is not
// a rainbow.
static void hue_rgb(float h, float *out) {
  h -= floorf(h);
  float x = h * 6.0f;
  int i = (int) x;
  float f = x - (float) i;
  switch (i % 6) {
    case 0:  out[0] = 1.0f;    out[1] = f;       out[2] = 0.0f;    break;
    case 1:  out[0] = 1.0f - f; out[1] = 1.0f;   out[2] = 0.0f;    break;
    case 2:  out[0] = 0.0f;    out[1] = 1.0f;    out[2] = f;       break;
    case 3:  out[0] = 0.0f;    out[1] = 1.0f - f; out[2] = 1.0f;   break;
    case 4:  out[0] = f;       out[1] = 0.0f;    out[2] = 1.0f;    break;
    default: out[0] = 1.0f;    out[1] = 0.0f;    out[2] = 1.0f - f; break;
  }
}

// Where every position sits along the effect axis, 0 at the trailing edge
// and 1 at the leading one. Same projection the gradient uses, normalized
// against the LEDs rather than the panel outline for the same reason. Only
// recomputed when the angle changes.
void Aip33628Panel::recompute_axis_() {
  const float a = effect_angle_ * 3.14159265f / 180.0f;
  const float ca = cosf(a), sa = sinf(a);

  float lo = 1e9f, hi = -1e9f;
  for (int blk = 0; blk < 4; blk++) {
    for (int seg = 0; seg < 9; seg++) {
      if (GEOM[blk][seg].id == 0)
        continue;
      float t = (GEOM[blk][seg].nx / 255.0f) * ca + (GEOM[blk][seg].ny / 255.0f) * sa;
      if (t < lo) lo = t;
      if (t > hi) hi = t;
    }
  }
  float span = hi - lo;
  if (span < 1e-6f)
    span = 1.0f;

  float blo = 1e9f, bhi = -1e9f;
  for (int blk = 0; blk < 4; blk++) {
    float sum = 0.0f;
    int n = 0;
    for (int seg = 0; seg < 9; seg++) {
      if (GEOM[blk][seg].id == 0)
        continue;
      float t = ((GEOM[blk][seg].nx / 255.0f) * ca + (GEOM[blk][seg].ny / 255.0f) * sa - lo) / span;
      axis_pos_[blk][seg] = t;
      sum += t;
      n++;
    }
    axis_blk_[blk] = n ? sum / (float) n : 0.0f;
    if (axis_blk_[blk] < blo) blo = axis_blk_[blk];
    if (axis_blk_[blk] > bhi) bhi = axis_blk_[blk];
  }

  // Normalized end to end, same as the per position axis. How much of the
  // wheel that covers is the hue span setting's job, not this one's.
  float bspan = bhi - blo;
  if (bspan < 1e-6f)
    bspan = 1.0f;
  for (int blk = 0; blk < 4; blk++)
    axis_blk_[blk] = (axis_blk_[blk] - blo) / bspan;
}

void Aip33628Panel::set_effect(int mode) {
  Effect want = mode == 1 ? Effect::CYCLE : mode == 2 ? Effect::FLASH : Effect::NONE;
  if (want == effect_)
    return;
  effect_ = want;
  effect_t0_ = millis();
  effect_at_ = 0;
  // Leaving an effect hands the panel back rather than freezing on whatever
  // frame it happened to stop at.
  envelope_ = 1.0f;
  if (want == Effect::NONE)
    clear_positions_();
  if (want == Effect::CYCLE)
    recompute_axis_();
  apply_colors_();
}

void Aip33628Panel::set_effect_speed(float seconds) {
  effect_speed_ = seconds < 0.1f ? 0.1f : (seconds > 600.0f ? 600.0f : seconds);
}

void Aip33628Panel::set_effect_spread(int mode) {
  spread_ = mode == 1 ? Spread::DIGIT : mode == 2 ? Spread::LED : Spread::PANEL;
}

void Aip33628Panel::set_effect_angle(float deg) {
  effect_angle_ = deg;
  recompute_axis_();
}

void Aip33628Panel::set_effect_hue_span(float deg) {
  hue_span_ = deg < 0.0f ? 0.0f : (deg > 360.0f ? 360.0f : deg);
}

void Aip33628Panel::set_flash_fade(float seconds) {
  flash_fade_ = seconds < 0.0f ? 0.0f : (seconds > 300.0f ? 300.0f : seconds);
}

// Advance whichever effect is running. Called from loop() at a fixed cadence
// rather than every pass, since the scan is what the eye sees and a redraw
// faster than about 25Hz buys nothing.
void Aip33628Panel::update_effect_(uint32_t now_ms) {
  float period = effect_speed_;
  float phase = fmodf((float) (now_ms - effect_t0_) / 1000.0f / period, 1.0f);

  if (effect_ == Effect::FLASH) {
    // A trapezoid. Rate and transition time are separate, so 1Hz with a 100ms
    // ramp and 1Hz snapping hard are both reachable. The on and off halves
    // stay even and the ramps eat into them rather than stretching the
    // period, so changing the fade never changes the flash rate.
    const float half = period * 0.5f;
    const float f = flash_fade_ > half ? half : flash_fade_;
    const float t = phase * period;
    float e;
    if (f <= 0.0f) {
      e = t < half ? 1.0f : 0.0f;  // square
    } else if (t < f) {
      e = t / f;
    } else if (t < half) {
      e = 1.0f;
    } else if (t < half + f) {
      e = 1.0f - (t - half) / f;
    } else {
      e = 0.0f;
    }
    envelope_ = e;
    apply_colors_();
    return;
  }

  // How much of the wheel the panel covers end to end. A full turn across
  // four digits packs the whole spectrum into a hand span and reads as noise.
  const float span = hue_span_ / 360.0f;

