herrceedjay/HU-058_ESPHome-ESP8266/firmware/esphome/components/aip33628/aip33628.cpp
  for (int blk = 0; blk < 4; blk++) {
    for (int seg = 0; seg < 9; seg++) {
      if (GEOM[blk][seg].id == 0)
        continue;
      float t = spread_ == Spread::PANEL  ? 0.0f
                : spread_ == Spread::DIGIT ? axis_blk_[blk]
                                           : axis_pos_[blk][seg];
      hue_rgb(phase + t * span, pos_rgb_[blk][seg]);
      pos_set_[blk][seg] = true;
    }
  }
  apply_colors_();
}

void Aip33628Panel::loop() {
  uint32_t now_ms = millis();

  if (effect_ != Effect::NONE && (int32_t) (now_ms - effect_at_) >= 0) {
    effect_at_ = now_ms + 40;  // 25Hz, smooth enough for a fade to glide
    update_effect_(now_ms);
  }

  // A temporary mode expires here rather than anywhere else, so there is one
  // place that can put the panel back to being a clock.
  if (mode_ != Mode::TIME && (int32_t) (now_ms - mode_until_) >= 0) {
    bool was_lamp = mode_ == Mode::LAMP;
    mode_ = Mode::TIME;
    dirty_ = true;
    if (was_lamp)
      apply_colors_();
  }

  ESPTime now{};
  bool valid = false;
  if (time_ != nullptr) {
    now = time_->now();
    valid = now.is_valid();
  }

  // Whatever is on the panel, reduced to one number, so an unchanged display
  // costs nothing. Time uses hour and minute together rather than the minute
  // alone, because Home Assistant can push a new timezone at any point and
  // every shift is a whole number of hours. A mode change sets dirty_ itself,
  // so the key never has to encode which mode produced it.
  int key = -1;
  if (mode_ == Mode::NUMBER) {
    key = number_;
  } else if (valid) {
    key = mode_ == Mode::SECONDS ? now.second : now.hour * 60 + now.minute;
  }

  // The colon blinks once a second, so the content changes more often than
  // the time does. Blinking off means a steady colon, not a dark one.
  bool colon = blink_colon_ ? ((now_ms / 1000) % 2 == 0) : true;

  if (!dirty_ && key == last_key_ && colon == last_colon_) return;
  last_key_ = key;
  last_colon_ = colon;
  dirty_ = false;

  for (auto &blk : on_) {
    for (bool &v : blk) v = false;
  }

  // A hardware check also works while the normal display light is off.
  if (mode_ == Mode::LAMP) {
    for (int blk = 0; blk < 4; blk++) {
      for (int seg = 0; seg < 9; seg++)
        on_[blk][seg] = GEOM[blk][seg].id != 0;
    }
    render_();
    return;
  }

  if (!enabled_) {
    render_();
    return;
  }

  // A pushed number does not need the clock to be set, so it comes first.
  if (mode_ == Mode::NUMBER) {
    draw_number_(number_, unit_);
    render_();
    return;
  }

  if (!valid) {
    // No time yet. Four dashes says so without pretending to know the hour.
    for (int i = 0; i < 4; i++) write_digit_(i, '-');
    render_();
    return;
  }

  if (mode_ == Mode::SECONDS) {
    // Seconds sit where the minutes normally do, behind a colon that stays
    // steady, so the panel reads as :SS rather than as a bare two digit
    // number that could be anything. The upper dot still follows the network.
    write_digit_(2, (char) ('0' + now.second / 10));
    write_digit_(3, (char) ('0' + now.second % 10));
    if (online_) write_pos_(1, SEG_ANNUN, true);
    write_pos_(1, SEG_ANNUN2, true);
    render_();
    return;
  }

  int hour = now.hour;
  bool pm = hour >= 12;
  if (twelve_hour_) {
    hour = hour % 12;
    if (hour == 0) hour = 12;
  }

  // Leading zero stays suppressed in 24 hour mode as well.
  if (hour >= 10) {
    write_digit_(0, (char) ('0' + hour / 10));
  }
  write_digit_(1, (char) ('0' + hour % 10));
  write_digit_(2, (char) ('0' + now.minute / 10));
  write_digit_(3, (char) ('0' + now.minute % 10));

  if (colon) {
    // Both dots when the network is up, the lower one alone when it is not.
    // Block 2 COM low LED1 is the lower dot, see docs/display-map.md.
    if (online_) write_pos_(1, SEG_ANNUN, true);
    write_pos_(1, SEG_ANNUN2, true);
  }
  if (twelve_hour_ && !pm) {
    write_pos_(0, SEG_ANNUN, true);  // AM indicator, lit through the morning
  }

  render_();
}

// Collapse the panel state into a scan schedule. Each COM pair is split into
// COLOR_BITS binary weighted sub-frames, and a channel at duty level L is lit
// in sub-frame k whenever bit k of L is set. Any level from 0 to
// COLOR_LEVELS - 1 is reachable that way, with no constraint that a dimmer
// channel be a subset of a brighter one.
//
// Per digit color costs nothing here. Each driver and COM pair together
// belong to exactly one block, since the two blocks on a driver sit on
// different COM pairs, so a slot only ever holds one block's color per
// driver and the two drivers carry their own SS word anyway. Four different
// colors reach sixteen steps, which is exactly MAX_STEPS.
void Aip33628Panel::render_() {
  uint16_t sub[2][4][COLOR_BITS] = {};

  for (int blk = 0; blk < 4; blk++) {
    const Block &b = BLOCKS[blk];
    for (int seg = 0; seg < 9; seg++) {
      if (!on_[blk][seg])
        continue;
      const SegPos &sp = SEGMAP[seg];
      int ci = com_index(sp.side ? b.com_hi : b.com_lo);
      int base = 3 * sp.led - 2;  // LED1 is SEG1..SEG3, LED5 is SEG13..SEG15
      for (int ch = 0; ch < 3; ch++) {
        uint8_t lv = level_[blk][seg][ch];
        if (lv == 0)
          continue;
        uint16_t bit = (uint16_t) (1u << (base + ch));
        for (int k = 0; k < COLOR_BITS; k++) {
          if (lv & (1u << k))
            sub[b.drv][ci][k] |= bit;
        }
      }
    }
  }

  // IS is set by the brightness alone and never by what is on screen. Making
  // it depend on the lit sink count changes the brightness of the whole panel
  // every time the colon blinks. The stock firmware held IS fixed across
  // colon on and colon off, and ran 0xF with a white digit lit.
  // The lamp test brings its own current, while max_current_ remains the
  // thermal ceiling for every mode.
  uint8_t want = mode_ == Mode::LAMP ? lamp_current_ : requested_current_;
  uint8_t is = want < max_current_ ? want : max_current_;

  ScanBuf &b = buf_[front_ ^ 1];
  b.n = 0;
  for (int ci = 0; ci < 4; ci++) {
    for (int k = 0; k < COLOR_BITS; k++) {
      uint16_t s0 = sub[0][ci][k];
      uint16_t s1 = sub[1][ci][k];
      uint8_t units = (uint8_t) (1u << k);
      // Identical neighbors inside one COM pair merge, so a saturated color,
      // where every sub-frame carries the same data, ends up as one step of
      // the full 600us. Merging never crosses a COM boundary, because CS
      // changes there and the drivers have to be re-sent regardless.
      if (k > 0 && b.n > 0 && b.step[b.n - 1].ss[0] == s0 && b.step[b.n - 1].ss[1] == s1) {
        b.step[b.n - 1].units = (uint8_t) (b.step[b.n - 1].units + units);
        continue;
      }
      ScanStep &st = b.step[b.n++];
      st.units = units;
      st.ss[0] = s0;
      st.ss[1] = s1;
      st.cs = COM_SEQ[ci];
    }
  }
  b.is = is;

  // Publish. The barrier keeps the writes above from being reordered past the
  // flip, which is what stops the scan callback seeing a torn pattern while a
  // Home Assistant slider is being dragged.
  __sync_synchronize();
  front_ ^= 1;
}

}  // namespace aip33628
}  // namespace esphome
